[
    {
        "id": 1,
        "title": "Fact #1",
        "text": "At the age of three, Elon Musk shocked his boarding school classmates when, instead of taking the bus to the the petting zoo in Rietfontein, he excavated a twenty-three-mile tunnel, and using a solar-powered magnetic turbine, propelled himself to his destination twenty minutes before the others.",
        "notes": "",
        "tags": [
            "astounding feats",
            "childhood"
        ]
        ,
        "date": "2025-12-11T11:28:42.000Z"
    },
    {
        "id": 2,
        "title": "Fact #2",
        "text": "Elon Musk was a dwarf until the age of nineteen.",
        "notes": "",
        "tags": [
            "dwarvism"
        ],
        "date": "2025-12-12T11:28:42.000Z"
    },
    {
        "id": 3,
        "title": "Fact #3",
        "text": "Elon Musk has prehensile feet. He can peel bananas without using his hands.",
        "notes": "",
        "tags": [
            "astounding feats",
            "prehensilism"
        ],
        "date": "2025-12-13T11:28:42.000Z"
    },
    {
        "id": 4,
        "title": "Fact #4",
        "text": "Elon Musk failed remedial algebra in the eleventh grade. In revenge, he developed an intricate, untested mnemonic system for calculating the mathematical constant pi to the seventy thousandth place involving a story about an epochal war between two feuding gypsy space clans called the Peeblos and the Blottos.",
        "notes": "",
        "tags": [
            "astounding feats",
            "early failures"
        ],
        "date": "2025-12-14T11:28:42.000Z"
    },
    {
        "id": 5,
        "title": "Fact #5",
        "text": "Elon Musk’s father, Maurice Musk, was a successful singer of Siberian laments in the late 1960s. As a child, Elon often accompanied him on the oud.",
        "notes": "",
        "tags": [
            "maurice musk",
            "siberian roots"
        ],
        "date": "2025-12-15T14:29:36.000Z"
    },
    {
        "id": 6,
        "title": "Fact #6",
        "text": "Elon Musk sets aside three hours every two years to catch up on his reading.",
        "notes": "",
        "tags": [
            "literacy"
        ],
        "date": "2025-12-15T14:32:47.000Z"
    },
    {
        "id": 7,
        "title": "Fact #7",
        "text": "Elon Musk opened a wildly popular lemonade stand in Mooikloof Heights when he was seven, an anecdote that Walter Isaacson shares in his biography of Musk. The key to his success, Musk realized many years later, was not the quality of his lemonade, but the fact that, when he dispensed it from a garden hose (his original idea), he lost repeat customers. When he shifted to small paper cups, however, people returned for more of his product.",
        "notes": "",
        "tags": [
            "early failures",
            "great ideas",
            "pretoria",
            "walter isaacson"
        ],
        "date": "2025-12-16T10:09:57.000Z"
    },
    {
        "id": 8,
        "title": "Fact #8",
        "text": "According to Arthur Chu, Elon Musk’s IQ is 99, which is considered above average for the Dutch Boers of sub-Saharan Africa.",
        "notes": "",
        "tags": [
            "Arthur Chu",
            "Boers",
            "IQ"
        ],
        "date": "2025-12-18T20:01:30.000Z"
    },
    {
        "id": 9,
        "title": "Fact #9",
        "text": "Elon Musk is a champion speed eater and holds the world record for most hot dogs consumed (219) in under forty-five seconds.",
        "notes": "",
        "tags": [
            "astounding feats",
            "speed eating"
        ],
        "date": "2025-12-19T10:20:09.000Z"
    },
    {
        "id": 10,
        "title": "Fact #10",
        "text": "Elon Musk suffers from hyperlexia and reads too fast to comprehend the meaning of what he has read. Musk was diagnosed with the condition when he was struggling with his first start-up, and later admitted it was probably due to his many childhood attemps at ultra speed reading. Today, Musk can read, but only in short bursts.",
        "notes": "",
        "tags": [
            "early failures",
            "hyperlexia",
            "setbacks"
        ],
        "date": "2025-12-19T10:23:05.000Z"
    },
    {
        "id": 11,
        "title": "Fact #11",
        "text": "In his 2006 self-interview Musk on Musk, Elon Musk cites adult bed wetting as the primary driver of his hostile takeover of U.S. family entertainment center Chuck E. Cheese",
        "notes": "",
        "tags": [
            "adult bed wetting",
            "chuck e. cheese"
        ],
        "date": "2026-01-10T17:48:21.000Z"
    },
    {
        "id": 12,
        "title": "Fact #12",
        "text": "Despite being a skilled video games player, Elon Musk has never managed to shoot down more than two aliens per Galaga challenging stage.",
        "notes": "",
        "tags": [
            "galaga",
            "video games"
        ],
        "date": "2026-01-10T17:53:01.000Z"
    }
]